In [2]:
%load_ext sql
import pandas as pd
import sqlite3

In [3]:
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [4]:
%%sql
SELECT P1.program_code,C.professor_id, P.name, C.term
FROM COURSE_MEETINGS_FACTS AS C
LEFT JOIN PROFESSOR_DIMENSION AS P USING(professor_id)
LEFT JOIN PROGRAMS_DIMENSION AS P1 USING(program_id)
LEFT JOIN COURSE_CAT_DIMENSION AS C2 USING(cat_id)
WHERE program_id < 2 AND cat_id<1000
GROUP BY professor_id
ORDER BY professor_id DESC
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('AC', '976', 'Victor E.  Hartman', 'Spring2018'),
 ('AC', '930', "Joseph R.  D'Agostin", 'Spring2018'),
 ('AC', '9', 'Milo W.  Peck', 'Fall2017'),
 ('AC', '842', 'Charles   Gill', 'Fall2018'),
 ('AC', '841', 'Richard   Hunter', 'Fall2018'),
 ('AC', '840', 'Kristen   Tharrington', 'Fall2018'),
 ('AC', '8', 'Bruce   Bradford', 'Fall2017'),
 ('AC', '778', 'Jenna Marie  Allegretto', 'Fall2017'),
 ('AC', '777', 'David L.  Glinka', 'Fall2017'),
 ('AC', '776', 'Kara E.  Hunter', 'Fall2017')]

In [24]:
%%sql
SELECT C.course_title, C1.section,term, cap
FROM COURSE_MEETINGS_FACTS
LEFT JOIN COURSE_CAT_DIMENSION AS C USING(cat_id)
LEFT JOIN COURSES_DIMENSION AS C1 USING(course_dimension_id)
WHERE cat_id <100
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20),
 ('Roots of American Culture', 1, 'Fall2017', 20)]

In [26]:
%%sql 
SELECT L.location, start, end, cap
FROM COURSE_MEETINGS_FACTS
LEFT JOIN LOCATION_DIMENSION AS L
WHERE L.location_id = 2
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('DSB 111', '2017-09-07T11:00:00', '2017-09-07T12:15:00', 0),
 ('DSB 111', '2017-09-07T11:00:00', '2017-09-07T12:15:00', 0),
 ('DSB 111', '2017-09-11T11:00:00', '2017-09-11T12:15:00', 0),
 ('DSB 111', '2017-09-11T11:00:00', '2017-09-11T12:15:00', 0),
 ('DSB 111', '2017-09-14T11:00:00', '2017-09-14T12:15:00', 0),
 ('DSB 111', '2017-09-14T11:00:00', '2017-09-14T12:15:00', 0),
 ('DSB 111', '2017-09-18T11:00:00', '2017-09-18T12:15:00', 0),
 ('DSB 111', '2017-09-18T11:00:00', '2017-09-18T12:15:00', 0),
 ('DSB 111', '2017-09-21T11:00:00', '2017-09-21T12:15:00', 0),
 ('DSB 111', '2017-09-21T11:00:00', '2017-09-21T12:15:00', 0)]

In [14]:
%%sql
SELECT DISTINCT C1.course_title, c.act,c.term
FROM COURSE_MEETINGS_FACTS AS C
LEFT JOIN PROFESSOR_DIMENSION AS P USING (professor_id)
LEFT JOIN COURSE_CAT_DIMENSION AS C1 USING (cat_id)
WHERE P.name LIKE 'Michael P.  Coyne%'
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Introduction to Financial Accounting', 30, 'Fall2017'),
 ('Accounting Information for Decision-Making', 16, 'Fall2017'),
 ('Introduction to Financial Accounting', 28, 'Fall2018'),
 ('Accounting Information for Decision-Making', 23, 'Fall2018'),
 ('Introduction to Management Accounting', 32, 'Spring2019'),
 ('Accounting Information for Decision-Making', 17, 'Spring2019'),
 ('Introduction to Accounting', 9, 'Summer2018')]

In [ ]:
%%